Тест/Тест/src/Documents/Расписка/Расписка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Расписка</name>
  <basedOn>Document.ПродажаЗапчастей</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияИНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Выдан</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПодразделения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресРегистрации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереданнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Плательщик</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияИНомерПлательщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыданПлательщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачиПлательщика</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПодразделенияПлательщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресРегистрацииПлательщика</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПродажи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Тест/Тест/src/Documents/Расписка/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Макет = Документы.Расписка.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Расписка.АдресРегистрации,
	|	Расписка.АдресРегистрацииПлательщика,
	|	Расписка.Выдан,
	|	Расписка.ВыданПлательщика,
	|	Расписка.Дата,
	|	Расписка.ДатаВыдачи,
	|	Расписка.ДатаВыдачиПлательщика,
	|	Расписка.КодПодразделения,
	|	Расписка.КодПодразделенияПлательщика,
	|	Расписка.Номер,
	|	Расписка.ПереданнаяСумма,
	|	Расписка.Плательщик,
	|	Расписка.СерияИНомер,
	|	Расписка.СерияИНомерПлательщика,
	|	Расписка.Сотрудник,
	|	Расписка.Город,
	|	Расписка.НомерПродажи
	|ИЗ
	|	Документ.Расписка КАК Расписка
	|ГДЕ
	|	Расписка.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Расписка = Макет.ПолучитьОбласть("Расписка");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	
	Пока Выборка.Следующий() Цикл
		Дата  = Формат(Выборка.Дата, "ДЛФ=DD");
		СуммаПрописью = ЧислоПрописью(Выборка.ПереданнаяСумма, , "рубль, рубля, рублей, м, копейка, копейки, копеек, ж");
		ДатаВыдачи = Формат(Выборка.ДатаВыдачи, "ДЛФ=D") + "г.";
		ДатаВыдачиПлательщика = Формат(Выборка.ДатаВыдачиПлательщика, "ДЛФ=D;") + "г.";
		Пол = "";
		ПолПлательщик = "";
		
		Если Прав(Выборка.Сотрудник, 2) = "ич" Тогда
			Пол = "зарегистрированный";
		Иначе
			Пол = "зарегистрированная";
		КонецЕсли;
		
		Если Прав(Выборка.Плательщик, 2) = "ич" Тогда
			ПолПлательщик = "зарегистрированного";
		Иначе
			ПолПлательщик = "зарегистрированной";
		КонецЕсли;
		
		Плательщик = ОбщегоНазначенияВызовСервера.ПросклонятьФИО(Выборка.Плательщик, 2 );
		
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ОбластьЗаголовок.Параметры.Город = "г." + Выборка.Город;
		ОбластьЗаголовок.Параметры.Дата = Дата;
		ТабДок.Вывести(ОбластьЗаголовок);

		Расписка.Параметры.Заполнить(Выборка);
		Расписка.Параметры.ПереданнаяСуммаПрописью = СуммаПрописью;
		Расписка.Параметры.ДатаВыдачи = ДатаВыдачи;
		Расписка.Параметры.ДатаВыдачиПлательщика = ДатаВыдачиПлательщика;
		Расписка.Параметры.Зарегистрирован = Пол;
		Расписка.Параметры.ЗарегистрированПлательщик = ПолПлательщик;
		Расписка.Параметры.Плательщик = Плательщик;
		ТабДок.Вывести(Расписка);
		
		Подвал.Параметры.Дата = Дата;
		Подвал.Параметры.Сотрудник = Выборка.Сотрудник;
		ТабДок.Вывести(Подвал);
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры
